app/controllers/groups_controller.rb

  def create
    @group = Group.new(group_params)
    @group.user_id = current_user.id

    respond_to do |format|
      if @group.save
---
INSERT INTO "groups" ("name", "icon", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Finance"], ["icon", "fa-credit-card"], ["user_id", 2], ["created_at", "2020-08-17 17:33:29.958636"], ["updated_at", "2020-08-17 17:33:29.958636"]]