app/controllers/groups_controller.rb

  def index
    @groups = Group.order(name: :asc).all
---
SELECT "groups".* FROM "groups" ORDER BY "groups"."name" ASC