app/controllers/transactions_controller.rb

  def index
    @user_transactions = Transaction.int_display(current_user.id).order(created_at: :desc)
    @transaction_sum = @user_transactions.sum(:amount)
---
SELECT "transactions".* FROM "transactions" WHERE "transactions"."user_id" = ? ORDER BY "transactions"."created_at" DESC  [["user_id", 1]]
SELECT "transactions".* FROM "transactions"
SELECT SUM("transactions"."amount") FROM "transactions"

  def create
    @transaction = Transaction.new(transaction_params)
    @transaction.user_id = current_user.id

    respond_to do |format|
      if @transaction.save
---
INSERT INTO "transactions" ("name", "amount", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "lunch in town"], ["amount", 14], ["user_id", 2], ["created_at", "2020-08-13 07:40:19.411386"], ["updated_at", "2020-08-13 07:40:19.411386"]]

  def etransaction
    @ext_user_transaction = Transaction.ext_display(current_user).order(created_at: :desc)
    @ext_transaction_sum = @ext_user_transaction.sum(:amount)
---
SELECT SUM("transactions"."amount") FROM "transactions"

  def members_transactions
    @members = Transaction.by_user
    @members_sum = Transaction.all.sum(:amount)
---
SELECT SUM("transactions"."amount") FROM "transactions"