app/controllers/transactions_controller.rb

SELECT SUM("transactions"."amount") FROM "transactions"
---
  def members_transactions
    @members = Transaction.by_user
    @members_sum = Transaction.all.sum(:amount)