app/views/transactions/index.html.erb

          <div class="col-2 d-flex justify-content-center">
            <i class="fas <%= transaction.group.icon %> fa-2x pr-3 pl-3 mt-3 blue-colored"></i>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]